#### Terraform Plan - `dev` 🏗️
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.global: Reading...
module.rds.random_password.db_password: Refreshing state... [id=none]
data.terraform_remote_state.global: Read complete after 2s
module.ecs.data.aws_region.current: Reading...
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/airas-dev]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-06e3ac500fac3ae4c]
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ba3a9abd086e9f7e]
module.dns.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:ap-northeast-1:427979936961:certificate/8e26fac8-ca08-405d-909b-25ac873778d7]
module.ecs.aws_iam_role.ecs_task: Refreshing state... [id=airas-dev-ecs-task]
module.rds.aws_secretsmanager_secret.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/dev/db-password-drWWHZ]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:cluster/airas-dev-cluster]
module.ecs.aws_iam_role.ecs_execution: Refreshing state... [id=airas-dev-ecs-execution]
module.dns.aws_route53_record.frontend: Refreshing state... [id=Z00135631AKUHNYG247OE_app-dev.airas.io_CNAME]
module.ecs.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=airas-dev-ecs-execution-20260221155811897600000002]
module.dns.aws_route53_record.cert_validation["api-dev.airas.io"]: Refreshing state... [id=Z00135631AKUHNYG247OE__492bf485b32f1b9bc572f8289a844612.api-dev.airas.io._CNAME]
module.ecs.aws_ecs_task_definition.this: Refreshing state... [id=airas-dev-backend]
module.dns.aws_acm_certificate_validation.api: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0ebc8828c27b3d7ff]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ff387e9382915106]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-084eb66d08dba076e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dab3205cd79e392f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ac24092c648753f7]
module.ecs.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:targetgroup/airas-dev-tg/a284ebaaa9978ac2]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-0ac6c8faf6a48af57]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0689fb81b5ba5c457]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0512122df70e71032]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0aa264f36177eea2c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0db280ab36a4073e2]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-0a548a18d043b0d06]
module.ecs.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:loadbalancer/app/airas-dev-alb/19a93d48bd24d161]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0172598c99ba4c137]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0fe3ff7d4df13427d]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=airas-dev-db-subnet]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-06eaf0bd48cb92604]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b6a194735d9cc411]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fb541d6d9b35d197]
module.monitoring.aws_cloudwatch_metric_alarm.alb_5xx: Refreshing state... [id=airas-dev-alb-5xx]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:listener/app/airas-dev-alb/19a93d48bd24d161/0354da7510c96929]
module.ecs.aws_lb_listener.https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:listener/app/airas-dev-alb/19a93d48bd24d161/05c6317745779a2c]
module.dns.aws_route53_record.api: Refreshing state... [id=Z00135631AKUHNYG247OE_api-dev.airas.io_A]
module.rds.aws_db_instance.this: Refreshing state... [id=db-BGESMPNBLS7ZIKQK5QE6KJ5IVI]
module.rds.aws_secretsmanager_secret_version.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/dev/db-password-drWWHZ|terraform-20260221160905866600000003]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=airas-dev-rds-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=airas-dev-rds-storage-low]
module.monitoring.aws_cloudwatch_metric_alarm.rds_connections_high: Refreshing state... [id=airas-dev-rds-connections-high]
module.ecs.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:service/airas-dev-cluster/airas-dev-backend]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_cpu_high: Refreshing state... [id=airas-dev-ecs-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_memory_high: Refreshing state... [id=airas-dev-ecs-memory-high]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-1:427979936961:service/airas-dev-cluster/airas-dev-backend"
        name                               = "airas-dev-backend"
        tags                               = {
            "Name" = "airas-dev-backend"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend:15" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "dev"
                        },
                    ]
                  - essential        = true
                  - image            = "427979936961.dkr.ecr.ap-northeast-1.amazonaws.com/airas-backend:dev"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/airas-dev"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "backend"
                        }
                    }
                  - mountPoints      = []
                  - name             = "backend"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "airas-dev-backend" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "Name" = "airas-dev-backend"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy.ecs_execution_secrets[0] will be created
  + resource "aws_iam_role_policy" "ecs_execution_secrets" {
      + id          = (known after apply)
      + name        = "airas-dev-ecs-secrets"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "airas-dev-ecs-execution"
    }

  # module.secrets.aws_secretsmanager_secret.app["anthropic-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/anthropic-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "ANTHROPIC_API_KEY"
          + "Name"       = "airas-dev-anthropic-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "ANTHROPIC_API_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-anthropic-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["database-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/database-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "DATABASE_URL"
          + "Name"       = "airas-dev-database-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "DATABASE_URL"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-database-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["enterprise-enabled"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/enterprise-enabled"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "ENTERPRISE_ENABLED"
          + "Name"       = "airas-dev-enterprise-enabled"
        }
      + tags_all                       = {
          + "EnvVarName"  = "ENTERPRISE_ENABLED"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-enterprise-enabled"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["gemini-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/gemini-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "GEMINI_API_KEY"
          + "Name"       = "airas-dev-gemini-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "GEMINI_API_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-gemini-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["gh-pat"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/gh-pat"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "GH_PERSONAL_ACCESS_TOKEN"
          + "Name"       = "airas-dev-gh-pat"
        }
      + tags_all                       = {
          + "EnvVarName"  = "GH_PERSONAL_ACCESS_TOKEN"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-gh-pat"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-base-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/langfuse-base-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_BASE_URL"
          + "Name"       = "airas-dev-langfuse-base-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_BASE_URL"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-langfuse-base-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-public-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/langfuse-public-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_PUBLIC_KEY"
          + "Name"       = "airas-dev-langfuse-public-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_PUBLIC_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-langfuse-public-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-secret-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/langfuse-secret-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_SECRET_KEY"
          + "Name"       = "airas-dev-langfuse-secret-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_SECRET_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-langfuse-secret-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["openai-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/openai-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "OPENAI_API_KEY"
          + "Name"       = "airas-dev-openai-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "OPENAI_API_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-openai-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["qdrant-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/qdrant-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "QDRANT_API_KEY"
          + "Name"       = "airas-dev-qdrant-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "QDRANT_API_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-qdrant-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-anon-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/supabase-anon-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_ANON_KEY"
          + "Name"       = "airas-dev-supabase-anon-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_ANON_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-supabase-anon-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-jwt-secret"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/supabase-jwt-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_JWT_SECRET"
          + "Name"       = "airas-dev-supabase-jwt-secret"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_JWT_SECRET"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-supabase-jwt-secret"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/supabase-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_URL"
          + "Name"       = "airas-dev-supabase-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_URL"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-supabase-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["wandb-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/dev/wandb-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "WANDB_API_KEY"
          + "Name"       = "airas-dev-wandb-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "WANDB_API_KEY"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-dev-wandb-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret_version.app["anthropic-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["database-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["enterprise-enabled"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["gemini-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["gh-pat"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-base-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-public-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-secret-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["openai-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["qdrant-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-anon-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-jwt-secret"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["wandb-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 30 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
*Pushed by: @fuyu-quant*